app/Models/Auth_model.php

SELECT `a`.*, `b`.`utype` AS `utype_name`
FROM `ml_user` `a`
JOIN `ml_user_type` `b` ON `a`.`utype` = `b`.`id`
WHERE `a`.`email` = 'admin@ml.com'
AND `a`.`status` = 1
---
    public function get_user(string $email) {
        $result = $this->db->table(DB_PREFIX . 'user a');
        $result->select('a.*,b.utype AS utype_name');
        $result->join(DB_PREFIX . 'user_type b', 'a.utype = b.id');
        return $result->where(["a.email" => $email, "a.status" => 1])->get()->getRow();

SELECT *
FROM `ml_user_type`
WHERE `id` = 1
AND `status` = 1
---
    public function get_user_types_by($where, $result_type = 0) {
        $result = $this->db->table(DB_PREFIX . 'user_type');
        $result->select('*');
        $result->where("status", 1);
        $result->where($where);

        if ($result_type == 0) {
            return $result->get()->getResult();
        } else {
            return $result->get()->getResultArray();